art-jin/esp32-rlcd-apps/sdkconfig.defaults
# Board
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (8MB octal on ESP32-S3-WROOM-1-N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# C++ support (required for XiaoZhi component)
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024

# Code size optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# Main task stack (XiaoZhi event loop + calendar tasks)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Memory optimization
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n

# Cache tuning for ESP32-S3
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# XiaoZhi audio pipeline + KinCal TLS handshake + ST7306 SPI redraw are
# CPU-heavy and share CPU 1. Don't subscribe IDLE tasks to the WDT —
# individual worker tasks manage their own yields via vTaskDelay and
# are unsubscribed from the WDT themselves where appropriate.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Console output via USB Serial/JTAG (frees GPIO43/44 from UART0)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# HTTP Server (CodePilot WebSocket on port 7897)
CONFIG_HTTPD_WS_SUPPORT=y
